app/controllers/addresses_controller.rb

  def index
    @addresses = Address.all
---
SELECT "addresses".* FROM "addresses"