app/controllers/comments_controller.rb

  def new
    puts "******* new *******"
    puts "** params.inspect: #{params.inspect}"
    @user = User.find(session[:user_id])
    @post = Post.find(params[:post_id])
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT ?  [["id", nil], ["LIMIT", 1]]