app/controllers/posts_controller.rb

  def index
    puts "******* index *******"
    puts "** params.inspect: #{params.inspect}"
    @user = User.find(params[:user_id])
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", nil], ["LIMIT", 1]]

  def show
    puts "******* show *******"
    @user = User.find(@post[:user_id])
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

  def edit
    puts "******* edit *******"
    puts "** params.inspect: #{params.inspect}"
    @user = User.find(params[:user_id])
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

  def update
    puts "******* update *******"
    respond_to do |format|
      if @post.update(post_params)
---
UPDATE "posts" SET "content" = ?, "updated_at" = ? WHERE "posts"."id" = ?  [["content", "adjbdjbadj jfgxjydjytdrj"], ["updated_at", 2017-02-16 22:27:30 UTC], ["id", 1]]