app/controllers/users_controller.rb

  def signin
    puts "******* signin *******"
    puts "** signin_params.inspect: #{signin_params.inspect}"
    @user = User.where(username: signin_params[:username]).first
---
SELECT  "users".* FROM "users" WHERE "users"."username" = ? ORDER BY "users"."id" ASC LIMIT ?  [["username", "akorkor"], ["LIMIT", 1]]

  def index
    puts "******* index *******"
    @users = User.all
---
SELECT "users".* FROM "users"

  def home
    puts "******* home *******"
    @postsArray = []
    @users = User.all
    @users.each do |user|
      posts = user.posts
      if posts.length > 0
---
SELECT "users".* FROM "users"
SELECT "posts".* FROM "posts" WHERE "posts"."user_id" = ?  [["user_id", 1]]

  def show
    puts "******* show *******"
    puts " ** session[:user_id]: #{session[:user_id]}"
    @posts = Post.all
---
SELECT "posts".* FROM "posts" WHERE "posts"."user_id" = ?  [["user_id", 6]]

  def create
    puts "******* create *******"
    @user = User.new(user_params)

    respond_to do |format|
      if @user.save
---
INSERT INTO "users" ("created_at", "updated_at") VALUES (?, ?)  [["created_at", 2017-02-15 17:27:00 UTC], ["updated_at", 2017-02-15 17:27:00 UTC]]